tutorials/iceFoam_tutorial/cylinder2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    front
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          12300;
        startFace       24310;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          110;
        startFace       36610;
    }
    back
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          12300;
        startFace       36720;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       49020;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       49140;
    }
    cylinderback
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          60;
        startFace       49260;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          110;
        startFace       49320;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          60;
        startFace       49430;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
60
(
(1.387778781e-17 -0 4.33680869e-19)
(-0 8.67361738e-19 -0)
(1.387778781e-17 1.734723476e-18 -0)
(-0 1.734723476e-18 -0)
(1.387778781e-17 -8.67361738e-19 -0)
(-1.387778781e-17 -0 3.469446952e-18)
(1.387778781e-17 -0 -0)
(1.387778781e-17 -1.734723476e-18 -0)
...
)
;
    }
)

// ************************************************************************* //
